/*Отделите графически все корни уравнения.
1. Составьте методику решения нелинейного уравнения для метода
половинного деления, метода Ньютона, метода простых итераций.
2. Составьте программу уточнения корня методом половинного деления с
точностью до ε, выводящую результаты в таблицу:
N an bn bn – an
… … … …
где an bn – концы вложенных отрезков.
3. Составьте программу уточнения корня методом Ньютона и методом
простых итераций с точностью до ε, выводящую результаты в таблицу:
*/

#include <iostream>

using namespace std;

int main(){ // 2 * ln(x) - 0.5 * x + 1 = 0 
    
}
